app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('test', 1, 2, '2021-01-26 02:39:26.444941', '2021-01-26 02:39:26.444941')
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save