app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototype = Prototype.all

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 'test', 'ttt', 3, '2021-01-26 05:54:50.209225', '2021-01-26 05:54:50.209225')
---
  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3)
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 4
---
  def show
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)

UPDATE `prototypes` SET `prototypes`.`catch_copy` = 'test11', `prototypes`.`updated_at` = '2021-01-26 06:31:32.586727' WHERE `prototypes`.`id` = 4
---
  def update
    if @prototype.update(prototype_params)

DELETE FROM `prototypes` WHERE `prototypes`.`id` = 4
---
  def destroy
    @prototype.destroy

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]
---
  def redirect_index
    @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 4 LIMIT 1
---
  def prototype_find_id
    @prototype = Prototype.find(params[:id])